pp/Final/Summary.org
* Models of computations; substition model
- file:NamesAbstractionSubstitution.hs
- file:VM.hs
- file:Fun.hs
* Goto ↔ Loops, Inlining procedures, Procedures → Gotos, Pointers and passing by reference
file:InsertionSort.c
file:LoopsToGoto.c

file:../Templates/Pointers.c
file:ByRefAsVonNeumann.cpp
file:ByValueAsSubstModel.cpp
* Recursion. Substitution model in the presence of recursion, Explicit stack
file:../Templates/Fib.hs
file:fact.c
file:factTail.c
file:hanoi.c
* Inheritance, Interfaces
file:Date.cpp
file:DateRec.cpp
file:Animals.cpp
file:AnimalsRec.cpp

* Algebraic Types (Pattern matching, Parametric types, Currification)
file:AlgebraicTypes.hs
file:AlgebraicTypes.java
* HO Abstraction, Polymorphic functions, Closures
file:Fold.hs
file:HOT.hs
file:HOTExplicitClosure.hs
file:ExplicitClosure.hs
file:ExplicitClosure.java
** TODO file:ExplicitClosure.cpp
* Purity; Continuations and effects
file:ContinuationsStack.hs
file:ContinueAccum.hs
file:ContinueState.hs
file:Roots.hs
file:Lazy.hs
* Resource-managing processes
file:Process.hs
file:ConcurrentIORef.hs
file:CSPVariable.hs
file:RPCServer.hs
* Concurency to continuations
file:Server.hs
file:ServerWithContinuations.hs
file:RuntimeSystem.hs
* Intro to Logic Prog.; Unification
file:Family.curry
file:Map.curry
file:UnificationExamples.curry
file:Unify.hs
* Functions to Relations, Search as list of successes
file:Lists.curry
file:Search.hs
* BONUS
** Encoding data in the pure lambda calculus
file:Church.hs
** A defunctionalised interpreted for the lambda calculus
file:KAM.hs
