pp/Final/Summary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Summary</title>
<!-- 2016-03-03 tor 07:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jean-Philippe Bernardy" />
</head>
<body>
<div id="content">
<h1 class="title">Summary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Models of computations; substition model</a></li>
<li><a href="#sec-2">2. Goto ↔ Loops, Inlining procedures, Procedures → Gotos, Pointers and passing by reference</a></li>
<li><a href="#sec-3">3. Recursion. Substitution model in the presence of recursion, Explicit stack</a></li>
<li><a href="#sec-4">4. Inheritance, Interfaces</a></li>
<li><a href="#sec-5">5. Algebraic Types (Pattern matching, Parametric types, Currification)</a></li>
<li><a href="#sec-6">6. HO Abstraction, Polymorphic functions, Closures</a>
<ul>
<li><a href="#sec-6-1">6.1. <span class="todo TODO">TODO</span> </a></li>
</ul>
</li>
<li><a href="#sec-7">7. Purity; Continuations and effects</a></li>
<li><a href="#sec-8">8. Resource-managing processes</a></li>
<li><a href="#sec-9">9. Concurency to continuations</a></li>
<li><a href="#sec-10">10. Intro to Logic Prog.; Unification</a></li>
<li><a href="#sec-11">11. Functions to Relations, Search as list of successes</a></li>
<li><a href="#sec-12">12. BONUS</a>
<ul>
<li><a href="#sec-12-1">12.1. Encoding data in the pure lambda calculus</a></li>
<li><a href="#sec-12-2">12.2. A defunctionalised interpreted for the lambda calculus</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Models of computations; substition model</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="NamesAbstractionSubstitution.hs">NamesAbstractionSubstitution.hs</a>
</li>
<li><a href="VM.hs">VM.hs</a>
</li>
<li><a href="Fun.hs">Fun.hs</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Goto ↔ Loops, Inlining procedures, Procedures → Gotos, Pointers and passing by reference</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="InsertionSort.c">InsertionSort.c</a>
<a href="LoopsToGoto.c">LoopsToGoto.c</a>
</p>

<p>
<a href="../Templates/Pointers.c">../Templates/Pointers.c</a>
<a href="ByRefAsVonNeumann.cpp">ByRefAsVonNeumann.cpp</a>
<a href="ByValueAsSubstModel.cpp">ByValueAsSubstModel.cpp</a>
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Recursion. Substitution model in the presence of recursion, Explicit stack</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="../Templates/Fib.hs">../Templates/Fib.hs</a>
<a href="fact.c">fact.c</a>
<a href="factTail.c">factTail.c</a>
<a href="hanoi.c">hanoi.c</a>
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Inheritance, Interfaces</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="Date.cpp">Date.cpp</a>
<a href="DateRec.cpp">DateRec.cpp</a>
<a href="Animals.cpp">Animals.cpp</a>
<a href="AnimalsRec.cpp">AnimalsRec.cpp</a>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Algebraic Types (Pattern matching, Parametric types, Currification)</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="AlgebraicTypes.hs">AlgebraicTypes.hs</a>
<a href="AlgebraicTypes.java">AlgebraicTypes.java</a>
</p>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> HO Abstraction, Polymorphic functions, Closures</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="Fold.hs">Fold.hs</a>
<a href="HOT.hs">HOT.hs</a>
<a href="HOTExplicitClosure.hs">HOTExplicitClosure.hs</a>
<a href="ExplicitClosure.hs">ExplicitClosure.hs</a>
<a href="ExplicitClosure.java">ExplicitClosure.java</a>
</p>
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <span class="todo TODO">TODO</span> <a href="ExplicitClosure.cpp">ExplicitClosure.cpp</a></h3>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Purity; Continuations and effects</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="ContinuationsStack.hs">ContinuationsStack.hs</a>
<a href="ContinueAccum.hs">ContinueAccum.hs</a>
<a href="ContinueState.hs">ContinueState.hs</a>
<a href="Roots.hs">Roots.hs</a>
<a href="Lazy.hs">Lazy.hs</a>
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Resource-managing processes</h2>
<div class="outline-text-2" id="text-8">
<p>
<a href="Process.hs">Process.hs</a>
<a href="ConcurrentIORef.hs">ConcurrentIORef.hs</a>
<a href="CSPVariable.hs">CSPVariable.hs</a>
<a href="RPCServer.hs">RPCServer.hs</a>
</p>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Concurency to continuations</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="Server.hs">Server.hs</a>
<a href="ServerWithContinuations.hs">ServerWithContinuations.hs</a>
<a href="RuntimeSystem.hs">RuntimeSystem.hs</a>
</p>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Intro to Logic Prog.; Unification</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="Family.curry">Family.curry</a>
<a href="Map.curry">Map.curry</a>
<a href="UnificationExamples.curry">UnificationExamples.curry</a>
<a href="Unify.hs">Unify.hs</a>
</p>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Functions to Relations, Search as list of successes</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="Lists.curry">Lists.curry</a>
<a href="Search.hs">Search.hs</a>
</p>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> BONUS</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> Encoding data in the pure lambda calculus</h3>
<div class="outline-text-3" id="text-12-1">
<p>
<a href="Church.hs">Church.hs</a>
</p>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> A defunctionalised interpreted for the lambda calculus</h3>
<div class="outline-text-3" id="text-12-2">
<p>
<a href="KAM.hs">KAM.hs</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jean-Philippe Bernardy</p>
<p class="date">Created: 2016-03-03 tor 07:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
